In [3]:
import pandas as pd

In [4]:
df=pd.read_csv("gsearch_jobs.csv", low_memory=False)

In [5]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 62146 entries, 0 to 62145
Data columns (total 28 columns):
 #   Column               Non-Null Count  Dtype
---  ------               --------------  -----
 0   Unnamed: 0           62080 non-null  object
 1   index                62010 non-null  object
 2   title                62001 non-null  object
 3   company_name         61995 non-null  object
 4   location             61956 non-null  object
 5   via                  61985 non-null  object
 6   schedule_type        61718 non-null  object
 7   work_from_home       27997 non-null  object
 8   salary               10102 non-null  object
 9   search_location      61961 non-null  object
 10  salary_pay           10098 non-null  object
 11  salary_rate          10099 non-null  object
 12  salary_avg           10100 non-null  object
 13  salary_min           9516 non-null   object
 14  salary_max           9515 non-null   object
 15  salary_hourly        5907 non-null   object
 16  salary_yearly        4073 non-null   object
 17  salary_standardized  10091 non-null  object
 18  description_tokens   61952 non-null  object
 19  Unnamed: 19          5 non-null      object
 20  Unnamed: 20          5 non-null      object
 21  Unnamed: 21          5 non-null      object
 22  Unnamed: 22          5 non-null      object
 23  Unnamed: 23          5 non-null      object
 24  Unnamed: 24          5 non-null      object
 25  Unnamed: 25          5 non-null      object
 26  Unnamed: 26          4 non-null      object
 27  Unnamed: 27          4 non-null      object
dtypes: object(28)
memory usage: 13.3+ MB

In [6]:
df.head()

,Unnamed: 0,index,title,company_name,location,via,schedule_type,work_from_home,salary,search_location,...,description_tokens,Unnamed: 19,Unnamed: 20,Unnamed: 21,Unnamed: 22,Unnamed: 23,Unnamed: 24,Unnamed: 25,Unnamed: 26,Unnamed: 27
0,0,0,Data Analyst,Meta,Anywhere,via LinkedIn,Full-time,TRUE,101K–143K a year,United States,...,"['tableau', 'r', 'python', 'sql']",NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
1,1,1,Data Analyst,ATC,United States,via LinkedIn,Full-time,NaN,NaN,United States,...,[],NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
2,2,2,Aeronautical Data Analyst,"Garmin International, Inc.","Olathe, KS",via Indeed,Full-time,NaN,NaN,United States,...,['sql'],NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
3,3,3,Data Analyst - Consumer Goods - Contract to Hire,Upwork,Anywhere,via Upwork,Contractor,TRUE,15–25 an hour,United States,...,"['powerpoint', 'excel', 'power_bi']",NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
4,4,4,Data Analyst | Workforce Management,Krispy Kreme,United States,via LinkedIn,Contractor,NaN,90K–110K a year,United States,...,"['powerpoint', 'excel', 'outlook', 'word']",NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN

In [7]:
df.describe(include='all')

,Unnamed: 0,index,title,company_name,location,via,schedule_type,work_from_home,salary,search_location,...,description_tokens,Unnamed: 19,Unnamed: 20,Unnamed: 21,Unnamed: 22,Unnamed: 23,Unnamed: 24,Unnamed: 25,Unnamed: 26,Unnamed: 27
count,62080,62010,62001,61995,61956,61985,61718,27997,10102,61961,...,61952,5,5,5,5,5,5,5,4,4
unique,62027,3259,23314,13446,1270,1040,39,10,2231,7,...,11275,2,2,2,2,2,2,2,1,1
top,• Create and maintain standard processes,0,Data Analyst,Upwork,Anywhere,via LinkedIn,Full-time,TRUE,77K–116K a year,United States,...,[],Salesforce,AWS,etc.) Strong project management and KPI manag...,CDP,CSRD,GRI,SASB,EPA Energy,Smart
freq,18,28,6444,7533,18067,20475,45079,27979,413,61947,...,13352,4,4,4,4,4,4,4,4,4

In [8]:
df.isnull().sum()

Unnamed: 0                66
index                    136
title                    145
company_name             151
location                 190
via                      161
schedule_type            428
work_from_home         34149
salary                 52044
search_location          185
salary_pay             52048
salary_rate            52047
salary_avg             52046
salary_min             52630
salary_max             52631
salary_hourly          56239
salary_yearly          58073
salary_standardized    52055
description_tokens       194
Unnamed: 19            62141
Unnamed: 20            62141
Unnamed: 21            62141
Unnamed: 22            62141
Unnamed: 23            62141
Unnamed: 24            62141
Unnamed: 25            62141
Unnamed: 26            62142
Unnamed: 27            62142
dtype: int64

In [9]:
df = df.drop_duplicates()

In [10]:
df = df.dropna(subset=['title', 'company_name', 'location'])

In [11]:
df = df.loc[:, ~df.columns.str.contains('^Unnamed')]

In [12]:
df.loc[:, 'via'] = df['via'].fillna('Unknown')

In [13]:
df.loc[:, 'schedule_type'] = df['schedule_type'].fillna('Not Specified')

In [14]:
df = df.drop(columns=['index'])

In [15]:
df['title'] = df['title'].str.lower().str.strip()
df['company_name'] = df['company_name'].str.strip()
df['location'] = df['location'].str.strip()
df['work_from_home']=df['work_from_home'].str.strip()

In [16]:
import ast
def safe_parse_tokens(x):
    # Case 1: Already a list
    if isinstance(x, list):
        return x
    
    # Case 2: NaN or empty
    if pd.isna(x) or x == '':
        return []
    
    # Case 3: String that looks like a list
    if isinstance(x, str):
        try:
            return ast.literal_eval(x)
        except (ValueError, SyntaxError):
            return []  # fallback for malformed rows
    
    return []

In [17]:
df.loc[:, 'description_tokens'] = df['description_tokens'].apply(safe_parse_tokens)

In [18]:
df['description_tokens'].head(10)
df['description_tokens'].apply(type).value_counts()

description_tokens
<class 'list'>    61932
Name: count, dtype: int64

In [19]:
skill_map = {
    'power_bi': 'power bi',
    'powerbi': 'power bi',
    'ms excel': 'excel',
    'mysql': 'sql',
    'mssql': 'sql',
    'postgresql': 'sql',
    'postgres': 'sql',
    'redshift': 'aws',
    'snowflake': 'snowflake',
    'sas': 'sas',
    'spss': 'spss',
    'jupyter': 'python',
    'matplotlib': 'python',
    'pandas': 'python'
}

In [20]:
def normalize_skills(skill_list):
    normalized = []
    for skill in skill_list:
        skill = skill.lower()
        normalized.append(skill_map.get(skill, skill))
    return list(set(normalized))  # remove duplicates

df.loc[:, 'description_tokens'] = df['description_tokens'].apply(normalize_skills)

In [21]:
df=df[['title','company_name','location','via','schedule_type','work_from_home','description_tokens']]

In [22]:
df.loc[:, 'work_from_home'] = df['work_from_home'].fillna(False)

In [30]:
import json

df['description_tokens'] = df['description_tokens'].apply(
    lambda x: json.dumps(x) if isinstance(x, list) else json.dumps([])
)

In [23]:
df.head(10)

,title,company_name,location,via,schedule_type,work_from_home,description_tokens
0,data analyst,Meta,Anywhere,via LinkedIn,Full-time,TRUE,"[r, python, tableau, sql]"
1,data analyst,ATC,United States,via LinkedIn,Full-time,False,[]
2,aeronautical data analyst,"Garmin International, Inc.","Olathe, KS",via Indeed,Full-time,False,[sql]
3,data analyst - consumer goods - contract to hire,Upwork,Anywhere,via Upwork,Contractor,TRUE,"[power bi, excel, powerpoint]"
4,data analyst | workforce management,Krispy Kreme,United States,via LinkedIn,Contractor,False,"[excel, powerpoint, outlook, word]"
5,data analyst,Flint Hills Resources,"Wichita, KS",via Jora,Full-time,False,"[python, power bi, excel, aws, sql, typescript]"
6,data analyst (model validation),Swedbank,Anywhere,via JobTeaser,Full-time,TRUE,"[sas, python, spss, sql]"
7,data analyst,AEG,United States,via IT Job Depot,Full-time,False,"[python, power bi, aws, jira, tableau, sql, sn..."
8,it financial data analyst lead,Progressive,Anywhere,via Jobgether,Full-time,TRUE,[]
9,data analyst,Chloeta,"Oklahoma City, OK",via ZipRecruiter,Full-time,False,"[r, python]"

In [24]:
df.isnull().sum()

title                 0
company_name          0
location              0
via                   0
schedule_type         0
work_from_home        0
description_tokens    0
dtype: int64

In [25]:
pip install mysql-connector-python sqlalchemy pymysql

Requirement already satisfied: mysql-connector-python in c:\users\user\appdata\local\programs\python\python312\lib\site-packages (9.3.0)
Requirement already satisfied: sqlalchemy in c:\users\user\appdata\local\programs\python\python312\lib\site-packages (2.0.43)
Collecting pymysql
  Downloading pymysql-1.1.2-py3-none-any.whl.metadata (4.3 kB)
Requirement already satisfied: greenlet>=1 in c:\users\user\appdata\local\programs\python\python312\lib\site-packages (from sqlalchemy) (3.2.4)
Requirement already satisfied: typing-extensions>=4.6.0 in c:\users\user\appdata\local\programs\python\python312\lib\site-packages (from sqlalchemy) (4.12.2)
Downloading pymysql-1.1.2-py3-none-any.whl (45 kB)
Installing collected packages: pymysql
Successfully installed pymysql-1.1.2
Note: you may need to restart the kernel to use updated packages.

WARNING: Ignoring invalid distribution ~ip (C:\Users\user\AppData\Local\Programs\Python\Python312\Lib\site-packages)
WARNING: Ignoring invalid distribution ~ip (C:\Users\user\AppData\Local\Programs\Python\Python312\Lib\site-packages)
WARNING: Ignoring invalid distribution ~ip (C:\Users\user\AppData\Local\Programs\Python\Python312\Lib\site-packages)

In [26]:
from sqlalchemy import create_engine

In [27]:
username = "root"
password = "12345"
host = "127.0.0.1"
port = "3306"
database = "jobs_analysis"

engine = create_engine(
    f"mysql+pymysql://{username}:{password}@{host}:{port}/{database}?charset=utf8mb4"
)

In [33]:
df.to_sql(
    name="gsearch_jobs",
    con=engine,
    if_exists="replace",
    index=False
)

61932